{
        "intro":"I have worked as a developer for more than 10 years, focused on web technologies, with a primary front end profile, programming in recent years in react, electron and nodejs for backend, with knowledge of automation mostly done with cypress and postman. \n\nWorking with cross-functional teams in agile environments, focusing on personal and team growth, working closely with business, designers and back-end developers.\n\nPersonally, I like to work in a team, I like both personal and team development, I am self-motivated, I try to have effective communication on both sides and help as much as possible, solve problems, help with information, propose and Do research technologies or solutions outside the box if necessary.",
        "recentTech": [
          {
            "name":"React",
            "info":"I have worked with the latest versions of react, I am aware of the hooks released after version 16.8, such as useState, useEffect, to mention a few"
          },
          {
            "name":"Redux ToolKit",
            "info":"We use Redux Toolkit for a couple of wide range applications, in the past I used redux but came to the conclusion that it was better to work with toolkit"
          },
          {
            "name":"Electron",
            "info":"We needed a lower desktop application for certain company users to work with logistics situations and we chose to use electron."
          },
          {
            "name":"NodeJs",
            "info":"I maintained a couple of applications in Nodejs, adding or modifying endpoints, I have knowledge of the REST architecture, I can develop under this architecture, preferably in Nodejs environments"
          },
          {
            "name":"Cypres",
            "info":"I have developed automation tests for UI in Cypres"
          },
          {
            "name":"Postman",
            "info":"I have developed and maintained endpoint automation tests with postman and newman"
          },
          {
            "name":"NextJs",
            "info":"I have made a couple of developments in nextjs like this page for example"
          },
          {
            "name":"Others",
            "info":"All of the above has been carried out under the CI/CD philosophy, managing git, gitlab and pipelines within gitlab, with qTest for managing test cases and jira for managing tasks, all this in an agile environment"
          }
        ],
   "generalInfo":
    {
        "name": "Omar Rodriguez Soberanes",
        "nationality": "Mexicano",
        "location": "Guadalajara, mexico",
        "phone": "6621393007",
        "email": "omar.rodsob@gmail.com",
        "speak": ["Espaniol Nativo","Ingles Negocios"],
        "pages":["https://www.linkedin.com/in/omarrodsob/","https://github.com/omar-rodsob","https://linktr.ee/"]
    },
    "experience":[{
        "nameCorp":"HCL Mexico",
        "location":"Guadalajara Jalisco",
        "dates":"September 2017 to December 2023",
        "positionName":"Front End Developer.",
        "info": "I worked as a contractor for USAA in the corporate services department.\n\nWe develop and maintain applications in react to provide maintenance to improve the productivity of the unit.\n\n● Front End Applications:\n\nWe developed applications with react and redux toolkit, one of them was a system to locate your work area based on a code generated by archibus, we developed an inventory management system that was used by more than 5,000 users, another system was developed for orthopedic equipment management.\n\n● BackEnd.\n\nI worked on maintaining a REST API that used information from the archibus system to be consumed by various departments within the organization, this under Nodejs.\n\n● Migrations and others.\n\nREST Apis migrations from hibernate to sprinboot.\n\nMigrations of Test Cases from readyapi to postman.\n\nOpenshift back end project migrations 3 to 4\n\nMigration of front end projects from openshift 3 to aws\n\nWorking mode:\n\nAgile environment based on scrum, being part of the complete cycle, product backlog, sprint backlog, planning, implementation, review, retrospective, with 2-week sprints."
    },
    {
        "nameCorp":"Korsoftocorp",
        "location":"Hermosillo sonora",
        "dates":"October 2013 to August 2017.",
        "positionName":"Front End Developer.",
        "info": "Support the team with the activities related to the front-end team, taking the duties to resolve both technical and business problems, helping management the releases of the applications in AppStore and playstore, making sure that we are on date with the requirements from both platforms, we launched 3 hybrid apps, one in Córdoba and two in react native, in addition to this, we maintain a fourth that was build in appcelerator. Projects Resume:\n We develop an app for the management of soccer football coaches taking control of the teams, games schedules,, players organization, and maintain communication with parents, was made in the first instance in Córdoba with ionic, and PHP on the back end side working with rest APIs maintained on aws cloud servers. Tools: Córdova, ionic, AppStore, playstore, GitHub, postman. Another app was to keep control of the maintenance activities for a college, keeping track of tasks on all floors, scheduled new activities, assigning duties, and track the activities by status, we have an admin portal build in php and one app on ios where the workers can see his activities, change the status . Tools: react native, redux, AppStore, playstore, GitHub, postman, aws.\n\nWorking mode:\n\nAgile environment based on scrum, being part of the complete cycle, product backlog, sprint backlog, planning, implementation, review, retrospective, with 2-week sprints."
    },
    {
        "nameCorp":" Internet Brands.",
        "location":"Guadalajara Jalisco",
        "dates":"February 2012 to October 2013.",
        "positionName":"Front End Developer.",
        "info": "I worked as a contractor for interntebrands for the content team as a front end developer.\n\nWe developed and maintained the www.carsdirect.com page, maintaining the content management module, this under php igniter and html and jquery for the front end, my tasks were focused on the front end, both on the management side of content as well as its visualization.\n\nI worked on the development of an image viewer for www.davesgarden.com/showcase, organizing the work for two collaborators, helping with code reviews, and the solution of various problems, analyzing the implementation of new technologies such as bootstrap, anguylar, jquerymobile.\n\nWe maintained a content system, in which the writers (end user) added their articles based on the platform or page on which they were going to be displayed, various calculations were carried out, such as the total number of words, among others, to create a fair payment for your articles, we were in charge of both the html and javascript for the interaction with the back end.\n\nnWorking mode:\n\nAgile environment based on scrum, forming part of the complete cycle, product backlog, sprint backlog, planning, implementation, review, retrospective, with 2-week sprints."
    },
    {
        "nameCorp":"quepasa.com",
        "location":"Hermosillo sonora",
        "dates":"October 2007 to January 2012.",
        "positionName":"Front End Developer.",
        "info": "Quepasa.com was a social network, I worked as a front end developer, becoming a team leader about 4 years after my stay in this company, we maintained the site in general, it was developed in PHP, and javascript plus html for the front end. , I had to go through several phases of technologies, working with mvc and then migrating to resapi, using pure javascript and transitioning to jquery, connections with third party applications, keeping track of usability, troubleshooting testing, doing research on new technologies, and keep control of the web analytics implemented and reviewing Google Analytics.\n\nWorking mode:\n\nFirst we worked in waterfall mode and transitioned to an agile environment starting in 2010, being part of the complete cycle, product backlog, sprint backlog, planning, implementation, review, retrospective, with 2-week sprints."
    }
    ],
    "skills":{
        "primary":["front end developer","web developer","hybrid mobile","developer"],
        "secundoary": ["Usability testing", "troubleshooting test", "Analyst Information","User experience", "Automation testing", "web analytics", "Back end"],
        "tools" : [ "javascript", "react"," react native", "redux", "lint", "enzyme", "npm","emacscript 6", "ajax","css", "html", "html5", "jquery mobile", "jquery", "node.js","app mobile delivery,","backbone", "html for mobile sites (responsive html)", "rest","web service", "json", "bootstrap", "couchdb", "dom manipulation php", "laravel","cordova", "phonegap", "titanium", "appcelerator", "hockeyapp", "testflight", "itunes","connect", "mysql", "workbrench", "moodle", "smarty", "velocity"]
    }
}